 # домашняя работа N4
# name = input("Введите имя: ")
# surname = input("Введите фамилию: ")
# patronymic = input("Введите отчество: ")
# age = input("Введите возраст: ")
# city = input("Ввелите город: ")
#
# print(name, surname, patronymic)
# print(age)
# print(city)

 # домашняя работа N5
a = int(input("Ведите число"))
b = int(input("Ведите число"))
c = int(input("Ведите число"))
print("сумма", a+b, "разность", a-b, "произведение", a*b, "деление", a/b, "возведение в степень", a**b)
print("сумма", a+c, "разность", a-c, "произведение", a*c, "деление", a/c, "возведение в степень", a**c)
print("сумма", b+c, "разность", b-c, "произведение", b*c, "деление", b/c, "возведение в степень", b**c)

print("сумма", a+b+c, "разность", a-b-c, "произведение", a*b*c, "деление", a/b/c,)
print("разность", b-a-c, "деление", b/a/c)
print("разность", c-a-b, "деление", c/a/b)